app/controllers/teams_controller.rb

def show
    @team = Team.find(params[:id]);
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", "2"]]

def create
    @team = Team.new(team_params)
    @team.save
---
INSERT INTO "teams" ("agreed", "created_at", "email", "name", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["agreed", true], ["created_at", Sun, 15 Sep 2013 03:46:49 UTC +00:00], ["email", "test@cats.com"], ["name", "test"], ["size", 2], ["updated_at", Sun, 15 Sep 2013 03:46:49 UTC +00:00]]